app/Controllers/Api/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `table_barang_rfid`
WHERE `barang_masuk_detail` IS NOT NULL
AND `barang_keluar_detail` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `table_barang_rfid`
---
    protected function box()
    {
        $db = \Config\Database::connect();
        $table_stock = $db->table('table_barang_rfid');
        $new_stock = $table_stock->where('barang_masuk_detail <>', NULL)->where('barang_keluar_detail', NULL)->countAllResults();
        $tag_registration = $table_stock->countAllResults();