app/Models/ArusStokModel.php

SELECT `table_barang`.`code`, `table_barang`.`name`, `table_satuan`.`name` as `unit`, COALESCE(stok_barang, 0) stok
FROM `table_barang`
LEFT JOIN `table_satuan` ON `table_satuan`.`id` = `table_barang`.`satuan`
LEFT JOIN (SELECT COUNT(*) as stok_barang, barang
        FROM table_barang_rfid
        WHERE barang_masuk_detail IS NOT NULL 
        AND barang_keluar_detail IS NULL
        GROUP BY barang) stok ON `stok`.`barang` = `table_barang`.`code`
---
    public function getArusStok()
    {
        $rawSql = new RawSql("SELECT COUNT(*) as stok_barang, barang
        FROM {$this->table}
        WHERE barang_masuk_detail IS NOT NULL
        AND barang_keluar_detail IS NULL
        GROUP BY barang");

        return $this->db->table("table_barang")
            ->select("table_barang.code, table_barang.name,table_satuan.name as unit, COALESCE(stok_barang, 0) stok")
            ->join("table_satuan", "table_satuan.id = table_barang.satuan",'left')
            ->join("($rawSql) stok", "stok.barang = table_barang.code",'left')
            ->get();